PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_syscall.h
/***************************************************************************//**
* \file ifx_se_syscall.h
* \version 1.1.0
*
* \brief
* This is the header file for low-level syscall functions.
*
********************************************************************************
* \copyright
* Copyright 2022-2024, Cypress Semiconductor Corporation (an Infineon company).
* All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

/*******************************************************************************
* IFX SE syscalls prototypes
****************************************************************************//**
*
* \defgroup syscalls     IFX SE low-level Syscall API
* \brief
*  IFX SE low-level Syscall functions
*
* \{
*   \defgroup syscall_errors Error codes
*       Error codes definitions
*   \defgroup syscall_macros Syscall macros
*       Syscall macros definitions
*   \defgroup syscall_funcs Syscall functions
*       Syscall functions definitions
* \}
*
*******************************************************************************/

#ifndef IFX_SE_SYSCALL_H
#define IFX_SE_SYSCALL_H

#include <stdint.h>

#include "ifx_se_fih.h"
#include "ifx_se_crc32.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Secure Runtime Services functions groups */
#define IFX_SE_SYSCALL_GROUP_MASK                          (0xFFFFFF00u)
#define IFX_SE_SYSCALL_GROUP_PSA_CRYPTO                    (0x752B4600u)
#define IFX_SE_SYSCALL_GROUP_RB_COUNTER                    (0x7B56C500u)
#define IFX_SE_SYSCALL_GROUP_SERVICES                      (0xD40ABF00u)
#define IFX_SE_SYSCALL_GROUP_ATTESTATION                   (0xC3456400u)
#define IFX_SE_SYSCALL_GROUP_PROTECTION                    (0xA25B2700u)
#define IFX_SE_SYSCALL_GROUP_WIFI                          (0x5B719A00u)
#define IFX_SE_SYSCALL_GROUP_TEST                          (0xFFFFFF00u)

/* Make Secure Runtime Services FIH based command IDs */
#define IFX_SE_SYSCALL_CODE(grp_id, cmd_id)                IFX_SE_FIH_UINT_INIT((uint32_t)(grp_id) | (uint32_t)(cmd_id))

/* Make Secure Runtime Services FIH based command Groups */
#define IFX_SE_SYSCALL_GROUP(grp_id)                       IFX_SE_SYSCALL_CODE(grp_id, 0)

/* Get Secure Runtime Services group value from FIH based command ID */
#define IFX_SE_SYSCALL_GET_GROUP(cmd)                      ifx_se_fih_uint_and(cmd, \
                                                             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_MASK, 0))
/* Secure Runtime Services functions */
/* IFX_SE_SYSCALL_GROUP_TEST service IDs */
#define IFX_SE_SYSCALL_TEST                                IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_TEST, 0)
/* IFX_SE_SYSCALL_GROUP_PSA_CRYPTO service IDs */
#define IFX_SE_SYSCALL_PSA_HASH_SETUP                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  1)
#define IFX_SE_SYSCALL_PSA_HASH_UPDATE                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  2)
#define IFX_SE_SYSCALL_PSA_HASH_FINISH                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  3)
#define IFX_SE_SYSCALL_PSA_HASH_VERIFY                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  4)
#define IFX_SE_SYSCALL_PSA_HASH_ABORT                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  5)
#define IFX_SE_SYSCALL_PSA_HASH_COMPUTE                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  6)
#define IFX_SE_SYSCALL_PSA_HASH_CLONE                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO,  7)
#define IFX_SE_SYSCALL_PSA_CIPHER_ENCRYPT                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 10)
#define IFX_SE_SYSCALL_PSA_CIPHER_DECRYPT                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 11)
#define IFX_SE_SYSCALL_PSA_CIPHER_ENCRYPT_SETUP            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 12)
#define IFX_SE_SYSCALL_PSA_CIPHER_DECRYPT_SETUP            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 13)
#define IFX_SE_SYSCALL_PSA_CIPHER_GENERATE_IV              IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 14)
#define IFX_SE_SYSCALL_PSA_CIPHER_SET_IV                   IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 15)
#define IFX_SE_SYSCALL_PSA_CIPHER_UPDATE                   IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 16)
#define IFX_SE_SYSCALL_PSA_CIPHER_ABORT                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 17)
#define IFX_SE_SYSCALL_PSA_CIPHER_FINISH                   IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 18)
#define IFX_SE_SYSCALL_PSA_SIGN_MESSAGE                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 20)
#define IFX_SE_SYSCALL_PSA_VERIFY_MESSAGE                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 21)
#define IFX_SE_SYSCALL_PSA_SIGN_HASH                       IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 22)
#define IFX_SE_SYSCALL_PSA_VERIFY_HASH                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 23)
#define IFX_SE_SYSCALL_PSA_MAC_COMPUTE                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 30)
#define IFX_SE_SYSCALL_PSA_MAC_VERIFY                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 31)
#define IFX_SE_SYSCALL_PSA_MAC_SIGN_SETUP                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 32)
#define IFX_SE_SYSCALL_PSA_MAC_VERIFY_SETUP                IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 33)
#define IFX_SE_SYSCALL_PSA_MAC_UPDATE                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 34)
#define IFX_SE_SYSCALL_PSA_MAC_SIGN_FINISH                 IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 35)
#define IFX_SE_SYSCALL_PSA_MAC_VERIFY_FINISH               IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 36)
#define IFX_SE_SYSCALL_PSA_MAC_ABORT                       IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 37)
#define IFX_SE_SYSCALL_PSA_AEAD_ENCRYPT                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 40)
#define IFX_SE_SYSCALL_PSA_AEAD_DECRYPT                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 41)
#define IFX_SE_SYSCALL_PSA_AEAD_ENCRYPT_SETUP              IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 42)
#define IFX_SE_SYSCALL_PSA_AEAD_DECRYPT_SETUP              IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 43)
#define IFX_SE_SYSCALL_PSA_AEAD_GENERATE_NONCE             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 44)
#define IFX_SE_SYSCALL_PSA_AEAD_SET_NONCE                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 45)
#define IFX_SE_SYSCALL_PSA_AEAD_SET_LENGTHS                IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 46)
#define IFX_SE_SYSCALL_PSA_AEAD_UPDATE_AD                  IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 47)
#define IFX_SE_SYSCALL_PSA_AEAD_UPDATE                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 48)
#define IFX_SE_SYSCALL_PSA_AEAD_FINISH                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 49)
#define IFX_SE_SYSCALL_PSA_AEAD_VERIFY                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 50)
#define IFX_SE_SYSCALL_PSA_AEAD_ABORT                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 51)
#define IFX_SE_SYSCALL_PSA_IMPORT_KEY                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 60)
#define IFX_SE_SYSCALL_PSA_GENERATE_KEY                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 61)
#define IFX_SE_SYSCALL_PSA_COPY_KEY                        IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 62)
#define IFX_SE_SYSCALL_PSA_DESTROY_KEY                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 63)
#define IFX_SE_SYSCALL_PSA_PURGE_KEY                       IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 64)
#define IFX_SE_SYSCALL_PSA_EXPORT_KEY                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 65)
#define IFX_SE_SYSCALL_PSA_EXPORT_PUBLIC_KEY               IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 66)
#define IFX_SE_SYSCALL_PSA_GET_KEY_ATTRIBUTES              IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 67)
#define IFX_SE_SYSCALL_PSA_GET_RANDOM                      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 68)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_SETUP            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 70)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_GET_CAPACITY     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 71)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_SET_CAPACITY     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 72)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_INPUT_BYTES      IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 73)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_INPUT_KEY        IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 74)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_OUTPUT_BYTES     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 75)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_OUTPUT_KEY       IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 76)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_ABORT            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 77)
#define IFX_SE_SYSCALL_PSA_KEY_DERIVATION_AGREEMENT        IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 78)
#define IFX_SE_SYSCALL_PSA_RAW_KEY_AGREEMENT               IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PSA_CRYPTO, 79)

