PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_syscall.h
/* IFX_SE_SYSCALL_GROUP_RB_COUNTER service IDs */
#define IFX_SE_SYSCALL_GET_ROLLBACK_COUNTER                IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_RB_COUNTER, 90)
#define IFX_SE_SYSCALL_UPDATE_ROLLBACK_COUNTER             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_RB_COUNTER, 91)
#define IFX_SE_SYSCALL_GET_USAGE_LIMIT_COUNTER             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_RB_COUNTER, 92)
/* IFX_SE_SYSCALL_GROUP_SERVICES service IDs */
#define IFX_SE_SYSCALL_DISABLE                             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_SERVICES, 95)
#define IFX_SE_SYSCALL_ENABLE                              IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_SERVICES, 96)
#define IFX_SE_SYSCALL_SET_LPM                             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_SERVICES, 97)
#define IFX_SE_SYSCALL_GET_INFO                            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_SERVICES, 98)
/* IFX_SE_SYSCALL_GROUP_ATTESTATION service IDs */
#define IFX_SE_SYSCALL_SET_SHARED_DATA                     IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_ATTESTATION, 100)
#define IFX_SE_SYSCALL_LOCK_SHARED_DATA                    IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_ATTESTATION, 101)
#define IFX_SE_SYSCALL_INIT_ATTEST_GET_TOKEN               IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_ATTESTATION, 102)
#define IFX_SE_SYSCALL_INIT_ATTEST_GET_TOKEN_SIZE          IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_ATTESTATION, 103)
/* IFX_SE_SYSCALL_GROUP_PROTECTION service IDs */
#define IFX_SE_SYSCALL_MPC_CONFIG_ROT_MPC_STRUCT           IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PROTECTION, 110)
#define IFX_SE_SYSCALL_MPC_LOCK                            IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PROTECTION, 111)
#define IFX_SE_SYSCALL_PPC_CONFIG                          IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_PROTECTION, 112)
/* IFX_SE_SYSCALL_GROUP_WIFI service IDs */
#define IFX_SE_SYSCALL_ENABLE_WIFI                         IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_WIFI, 120)
#define IFX_SE_SYSCALL_DISABLE_WIFI                        IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_WIFI, 121)
#define IFX_SE_SYSCALL_ENABLE_WIFI_SRAM_ACCESS             IFX_SE_SYSCALL_CODE(IFX_SE_SYSCALL_GROUP_WIFI, 122)

/* Maximal number of parameters in ipc_packet */
#define SE_RT_MAX_PARAMETERS_NUM         (15u)

/* Calculate packet sizes in 32-bit words */
#define SE_RT_PACKET_CTL_SIZE            (2u) /* only control fields (size and CRC) */
#define SE_RT_PACKET_MIN_SIZE            (SE_RT_PACKET_CTL_SIZE + sizeof(ifx_se_fih_uint) / sizeof(uint32_t)) /* control fields + cmd */
#define SE_RT_PACKET_MAX_SIZE            (SE_RT_PACKET_CTL_SIZE + (SE_RT_MAX_PARAMETERS_NUM + 1u) * sizeof(ifx_se_fih_uint) / sizeof(uint32_t))

/* Total packet size includes params, cmd, data size and CRC32 fields */
#define SE_RT_PACKET_CALC_SIZE(n)        (((2u * sizeof(uint32_t)) + (((n) + 1u) * sizeof(ifx_se_fih_uint))) / 4u)

/* Calculate packet sizes in 32-bit words */
#define SE_RT_PACKET_GET_SIZE(s)         ((s) / sizeof(uint32_t))

/* Get Params address inside ipc_packet to set parameters easily */
#define SE_RT_PARAMS_GET_PTR(p)          ((ifx_se_fih_uint *)(&(p)[1u]))

/* Get Command ID value from Params array inside ipc_packet */
#define SE_RT_PARAMS_GET_CMD(p)          (SE_RT_PARAMS_GET_PTR(p)[0])

/* Calc CRC32 of ipc_packet array of 32-bit word elements */
#define SE_RT_PACKET_FINALIZE(p)         { p[0] = sizeof(p); \
                                           p[(sizeof(p) / sizeof(uint32_t)) - 1u] = IFX_CRC32_CALC((uint8_t *)(p), sizeof(p) - sizeof(uint32_t)); }

typedef ifx_se_fih_uint ifx_se_status_t;

/** \addtogroup syscall_macros
 * \{
 */

/** Maximal number of images to store shared data */
#define IFX_SE_SHARED_DATA_IMAGES_NUM          (7u)

/** \} */

/** \addtogroup syscall_errors
 * \{
 */

/** Makes Secure Runtime Services Utility FIH based error code */
#define IFX_SE_ERROR_CODE(e)                   IFX_SE_FIH_UINT_INIT((uint32_t)(e))

/** Success operation */
#define IFX_SE_SUCCESS                         IFX_SE_ERROR_CODE(0xAA5533CCu)
/** The fail status of the SE RT Services return value */
#define IFX_SE_INVALID                         IFX_SE_ERROR_CODE(0xFF000000u)
/** Returned when SE RT Services in disabled state */
#define IFX_SE_DISABLED                        IFX_SE_ERROR_CODE(0xFF000001u)
/** Returned for non-supported algorithms or operations */
#define IFX_SE_SYSCALL_NOT_SUPPORTED           IFX_SE_ERROR_CODE(0xFF000002u)
/** Returned on general uncategorized error */
#define IFX_SE_SYSCALL_GENERAL_ERROR           IFX_SE_ERROR_CODE(0xFF000003u)
/** Returned by all APIs when client doesn't have access to region it is using for passing arguments. */
#define IFX_SE_SYSCALL_ADDR_PROTECTED          IFX_SE_ERROR_CODE(0xFF000004u)
/** Returned if a master with PC > 2 tries to use PSA syscall */
#define IFX_SE_SYSCALL_PROTECTED               IFX_SE_ERROR_CODE(0xFF000005u)
/** The opcode is not a valid API opcode. */
#define IFX_SE_SYSCALL_INVALID_OPCODE          IFX_SE_ERROR_CODE(0xFF000006u)
/** Returned if invalid arguments are passed to a API or SysCall */
#define IFX_SE_SYSCALL_INVALID_ARGUMENT        IFX_SE_ERROR_CODE(0xFF000007u)
/** \cond INTERNAL */
#define IFX_SE_SYSCALL_KEY_PROTECTED           IFX_SE_ERROR_CODE(0xFF000008u)
/** \endcond */
/** Returned when parameters data in non-supported memory regions (MAIN_NVM, SRAM, SOCMEM_RAM or XIP) */
#define IFX_SE_SYSCALL_ADDR_OUT_OF_RANGE       IFX_SE_ERROR_CODE(0xFF000009u)
/** Returned when Fault Injection attack detected */
#define IFX_SE_SYSCALL_FI_DETECTED             IFX_SE_ERROR_CODE(0xFF00000Au)
/** Returned on storage failures */
#define IFX_SE_SYSCALL_STORAGE_FAILURE         IFX_SE_ERROR_CODE(0xFF00000Bu)
/** Returned when data not written during defined timeout */
#define IFX_SE_SYSCALL_STORAGE_TIMEOUT         IFX_SE_ERROR_CODE(0xFF00000Cu)
/** Returned when over-voltage detected during syscall execution */
#define IFX_SE_SYSCALL_OV_DETECTED             IFX_SE_ERROR_CODE(0xFF00000Du)
/** Returned when RRAM clock (HFCLK0) not corresponding to selected RRAM power mode (LP/ULP) */
#define IFX_SE_SYSCALL_RRAM_CLK_ERROR          IFX_SE_ERROR_CODE(0xFF00000Eu)
/** Returned when CPU clock (HFCLK0) frequency not in the supported range (3,6MHz - 210MHz) */
#define IFX_SE_SYSCALL_INVALID_CLOCK           IFX_SE_ERROR_CODE(0xFF00000Fu)
/** Returned on data integrity (CRC check) error */
#define IFX_SE_SYSCALL_INTEGRITY_FAILURE       IFX_SE_ERROR_CODE(0xFF000010u)
/** Returned when input data bigger then supported */
#define IFX_SE_SYSCALL_INSUFFICIENT_STORAGE    IFX_SE_ERROR_CODE(0xFF000011u)
/** Returned when the output buffer is too small to store the operation output data */
#define IFX_SE_SYSCALL_BUFFER_TOO_SMALL        IFX_SE_ERROR_CODE(0xFF000012u)
/** Returned on output data preparation error */
#define IFX_SE_SYSCALL_DATA_INVALID            IFX_SE_ERROR_CODE(0xFF000013u)
/** Returned when address not aligned */
#define IFX_SE_SYSCALL_ADDR_NOT_ALIGNED        IFX_SE_ERROR_CODE(0xFF000014u)
/** Returned when input data size less then expected */
#define IFX_SE_SYSCALL_INSUFFICIENT_DATA       IFX_SE_ERROR_CODE(0xFF000015u)
/** Returned when number of syscall parameters is incorrect */
#define IFX_SE_SYSCALL_INVALID_PARAM_NUM       IFX_SE_ERROR_CODE(0xFF000016u)
/** Returned when syscall packet data is empty */
#define IFX_SE_SYSCALL_INVALID_PACKET_DATA     IFX_SE_ERROR_CODE(0xFF000017u)
/** Returned when syscall packet size is incorrect */
#define IFX_SE_SYSCALL_INVALID_PACKET_SIZE     IFX_SE_ERROR_CODE(0xFF000018u)
/** Returned when syscall packet data has damaged FIH parameters */
#define IFX_SE_SYSCALL_INVALID_PACKET_PARAM    IFX_SE_ERROR_CODE(0xFF000019u)
/** Returned when no operation context is available */
#define IFX_SE_SYSCALL_INSUFFICIENT_CONTEXT    IFX_SE_ERROR_CODE(0xFF00001Au)
/** Returned when allowed temperature is not in supported range (-40C - +125C) */
#define IFX_SE_SYSCALL_INVALID_TEMPERATURE     IFX_SE_ERROR_CODE(0xFF00001Bu)
/** Returned when no key usage Limit counter is available */
#define IFX_SE_SYSCALL_INSUFFICIENT_COUNTER    IFX_SE_ERROR_CODE(0xFF00001Cu)
/** Returned when syscall didn't respond until defined timeout */
#define IFX_SE_SYSCALL_TIMEOUT_ERROR           IFX_SE_ERROR_CODE(0xFF0000FEu)
/** Returned when memory allocation failed */
#define IFX_SE_SYSCALL_INVALID_MEM_ALLOC       IFX_SE_ERROR_CODE(0xFF0000FFu)
/** Returned when data corruption detected */
#define IFX_SE_SYSCALL_CORRUPTION_DETECTED     IFX_SE_ERROR_CODE(0xFFBADBADu)

