PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/se-rt-services-utils/ifx_se_syscall.h
/** \} */

/** \addtogroup syscall_macros
 * \{
 */

/** \cond INTERNAL */
#define IFX_SE_STATUS_CHECK(x, y)              ifx_se_fih_uint_eq(x, y)
#define IFX_SE_IS_STATUS_SUCCESS(y)            IFX_SE_STATUS_CHECK(IFX_SE_SUCCESS, y)
/** \endcond */

/** SE RT Services user defined syscall context */
#define IFX_SE_NULL_CTX                        NULL

/** Fault injection hardening, IPC data mask */
#define IFX_SE_IPC_FIH_MASK                    (uint32_t)(0x53AD6CB9UL)

/** \} */

/*******************************************************************************
 * SE RT Services syscall communication uses the next IPC settings:
 *
 * IPC channel to transfer data to SE RT Services
 * IFX_SE_IPC_SYSCALL =          (0u)
 *
 * IPC interrupt channel to notify SE RT Services for new request
 * IFX_SE_IPC_INTR_ACQ =         (0u)
 *
 * IPC interrupt channel to notify client from SE RT Services
 *                                        for processed request
 * IFX_SE_IPC_INTR_REL =         (1u)
 *
 * \note For this notification user should setup appropriate
 *       interrupt handler in his code.
 * \note SE RT Services library does not setup this notification handler
 *       by default by using blocking mode to wait for completion.
 *
 *******************************************************************************
 */

/* IPC channel to transfer data to SE RT Services */
#define IFX_SE_IPC_SYSCALL                     (0U)

/* IPC interrupt channel to notify SE RT Services for new request */
#define IFX_SE_IPC_INTR_ACQ                    (0U)

/* IPC interrupt channel to notify client from SE RT Services for processed request */
#define IFX_SE_IPC_INTR_REL                    (1U)

/** \addtogroup syscall_funcs
 * \{
 */

/*******************************************************************************
 * Function Name: ifx_se_syscall
 ***************************************************************************//**
 *
 * Used to call syscall to SE RT Services.
 *
 * \param[in] ipc_packet: The pointer to the buffer with syscall parameters.
 *
 * \param[in] ipc_packet_size: The size of the buffer with syscall parameters.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \return \ref IFX_SE_SUCCESS for success or error code
 *
 * \note This function is marked as WEAK so user can replace it
 * by own implementation according to the platform environment
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_syscall(ifx_se_fih_ptr_t ipc_packet, ifx_se_fih_t ipc_packet_size, void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_syscall_builtin
 ***************************************************************************//**
 *
 * Used to perform syscall to SE RT Services.
 *
 * \param[in] ipc_packet: The pointer to the buffer with syscall parameters.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \return \ref IFX_SE_SUCCESS for success or error code
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_syscall_builtin(ifx_se_fih_ptr_t ipc_packet, void *ctx);

/* Syscall HAL APIs */
/*******************************************************************************
 * Function Name: ifx_se_hal_syscall_lock
 ***************************************************************************//**
 *
 * Used to set syscall execution mutex in multi-threaded environments.
 *
 * Default implementation is not thread-safe and provided as template.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \return \ref IFX_SE_SUCCESS for success otherwise timeout error.
 *
 * \note This function is marked as WEAK so user can replace it
 * by own implementation according to the platform environment
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_hal_syscall_lock(void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_hal_syscall_start
 ***************************************************************************//**
 *
 * Used to acquire syscall IPC structure.
 * Additionally can be used to register IPC Release event callback.
 *
 * Should use Cy_IPC_Drv_LockAcquire to acquire syscall IPC structure.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \return \ref IFX_SE_SUCCESS for success otherwise timeout error.
 *
 * \note This function is marked as WEAK so user can replace it
 * by own implementation according to the platform environment
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_hal_syscall_start(void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_hal_syscall_wait_response
 ***************************************************************************//**
 *
 * Used to waiting the syscall response.
 *
 * Should use Cy_IPC_Drv_GetLockStatus or Cy_IPC_Drv_IsLockAcquired
 * to check syscall IPC structure status on waiting.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \return \ref IFX_SE_SUCCESS for success otherwise timeout error.
 *
 * \note This function is marked as WEAK so user can replace it
 * by own implementation according to the platform environment
 *
 ******************************************************************************/
ifx_se_status_t ifx_se_hal_syscall_wait_response(void *ctx);

/*******************************************************************************
 * Function Name: ifx_se_hal_syscall_release
 ***************************************************************************//**
 *
 * Used to release syscall execution mutex in multi-threaded environments.
 *
 * Default implementation is not thread-safe and provided as template.
 *
 * \param[in] *ctx: The pointer to the SE syscall context that contain a special
 * syscall data (IPC release callback etc).
 *
 * \note This function is marked as WEAK so user can replace it
 * by own implementation according to the platform environment
 *
 ******************************************************************************/
void ifx_se_hal_syscall_release(void *ctx);

/** \} */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* IFX_SE_SYSCALL_H */
